/*
*******************************************************************************
*                     《手把手教你学51单片机(C语言版)》
*                    配套 KST-51 单片机开发板 示例源代码
*
*         (c) 版权所有 2016 金沙滩工作室/清华大学出版社 保留所有权利
*                 获取更多资料请访问：http://www.qdkingst.com
*
* 文件名：Ultrasonic.c
* 描  述：使用定时器0配合普通IO口测量超声波的回波信号，从而计算出距离
* 版本号：v1.0.0
* 备  注：本例使用P2.6、P2.7连接超声波模块，如使用其它IO可在头文件中修改即可
*******************************************************************************
*/

#include "Ultrasonic.h"

/*软件延时，延时时间（t*10)us*/
void DelayX10us(unsigned char t)
{
    do {
        _nop_();
        _nop_();
        _nop_();
        _nop_();
        _nop_();
        _nop_();
        _nop_();
        _nop_();
    } while (--t);
}

/* 获取测量数据，返回值：以毫米为单位的距离值 */
unsigned int GetDistance()
{
    float time;
    float result;

    TH0 = 0;                  //定时器0清零，准备本次测距计数
    TL0 = 0;
    Trig = 1;                 //Trig 输出高电平
    DelayX10us(2);            //延时20us
    Trig = 0;                 //Trig输出低电平，至此产生一个20us的脉冲信号以启动超声波模块
    while(!Echo);             //等待回波信号：当Echo为0时等待，当Echo为1时继续往下执行
    TR0 = 1;                  //启动T0开始计时
    while(Echo);              //等待回波信号结束
    TR0 = 0;                  //关闭定时器0停止计时
    if (TF0 == 1)             //TF0为1时说明定时器溢出了
    {
        TF0 = 0;              //清除标志位
        time = 65535;         //溢出时，直接设置为最大计数值
    }
    else
    {
        time = TH0*256 + TL0; //未溢出时，读取其实际计数值
    }
    time = time * (12/11.0592) / 2;  //将计数周期转换为实际时间（us）；超声波测得的是来回距离，需要除以2得到单程距离所对应的时间
    result = (time/1000000) * 340;   //time(s)*速度 = 距离，340为声波在空气中的传播速度(m/s)
    if (result > 4.0)        //判断是否超出模块的测量范围
    {
        result = 4.0;        //超出上限4m则设置为4m
    }
    else if (result < 0.02)
    {
        result = 0.02;       //低于下限0.02m则设置为0.02m
    }
    return (unsigned int)(result*1000);   //以无符号整形数返回测量结果，乘1000使其单位变为毫米
}

/*初始化超声波模块*/
void InitUltrasonic()
{
    TMOD &= 0xf0;
    TMOD |= 0x01; //设置T0为方式1
    TH0 = 0;
    TL0 = 0;
    ET0 = 0;      //关闭T0中断
    Trig = 0;     //拉低模块触发引脚
}
